Revit 2027 API
ColorFillLegend.Height Property
 The height of the legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
public:
property double Height {
	double get ();
	void set (double value);
}
member Height : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for height must be positive.
Remarks
 Changing the height may result in a change in the count of columns.
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace